Revit 2026 API
BRepBuilderSurfaceGeometry.CreateNURBSSurface Method
Overload List
Name | Description
CreateNURBSSurface(Int32, Int32, IList<Double>, IList<Double>, IList<XYZ>, Boolean, BoundingBoxUV)
CreateNURBSSurface(Int32, Int32, IList<Double>, IList<Double>, IList<XYZ>, IList<Double>, Boolean, BoundingBoxUV)
Top
See Also
Reference
BRepBuilderSurfaceGeometry Class
Autodesk.Revit.DB Namespace